<template>
  <div class="contents">
    <div class="evt-viewer">
        <div class="evt-viewer-head">
            <h2>[7월] 월간오케어 당첨안내</h2>
            <span class="date">2023.08.14</span>
        </div>
        <div class="evt-viewer-cont">
            월간오케어 당첨안내 상세내용입니다. 월간오케어 당첨안내 상세내용입니다. 월간오케어 당첨안내 상세내용입니다. 월간오케어 당첨안내 상세내용입니다. 월간오케어 당첨안내 상세내용입니다. 월간오케어 당첨안내 상세내용입니다. 월간오케어 당첨안내 상세내용입니다. 월간오케어 당첨안내 상세내용입니다. 월간오케어 당첨안내 상세내용입니다. 월간오케어 당첨안내 상세내용입니다. 월간오케어 당첨안내 상세내용입니다. 월간오케어 당첨안내 상세내용입니다. 월간오케어 당첨안내 상세내용입니다. 월간오케어 당첨안내 상세내용입니다. 월간오케어 당첨안내 상세내용입니다. 월간오케어 당첨안내 상세내용입니다. 월간오케어 당첨안내 상세내용입니다. 월간오케어 당첨안내 상세내용입니다. 월간오케어 당첨안내 상세내용입니다. 월간오케어 당첨안내 상세내용입니다. 월간오케어 당첨안내 상세내용입니다. 월간오케어 당첨안내 상세내용입니다. 월간오케어 당첨안내 상세내용입니다. 월간오케어 당첨안내 상세내용입니다. 월간오케어 당첨안내 상세내용입니다. 월간오케어 당첨안내 상세내용입니다. 월간오케어 당첨안내 상세내용입니다. 
        </div>
    </div>
  </div>
</template>

<script>
</script>

<style lang="scss" scoped></style>
