<template>
    <div class="contents">
      <!-- TermsModal -->
      <DocumentModal
        modalTitle="약관 제목"
        v-model="documentModal"
        @close="documentModal = false"
      >
        <template #modalBody>
            <div class="ui-terms-wrap">
                <div class="terms-title">
                    <h1>오케어 쇼핑 및 파트너 유료서비스 이용 약관</h1>
                </div>
                <div class="terms-item">
                    <h2>제 1 조 (목적)</h2>
                    <div class="terms-list">
                        <p class="head">이 약관은 KB헬스케어가(이하 ‘회사’)가 제공하는 오케어쇼핑(이하 ‘쇼핑’)과 오케어와 제휴된 서비스 파트너(이하 ‘파트너’)가 제공하는 파트너 유료 서비스의 이용과 관련하여 회사와 회원과의 권리, 의무 및 책임사항, 기타 필요한 사항을 규정함을 목적으로 합니다.</p>
                    </div>
                </div>
                <div class="terms-item">
                    <h2>제 2조 (용어의 정의)</h2>
                    <div class="terms-list">
                        <ol>
                            <li>이 약관에서 사용하는 용어의 의미는 다음과 같습니다
                                <ol>
                                    <li>“오케어쇼핑”이란 회사가 재화 또는 서비스(이하 "재화 등"이라 함)를 이용자에게 제공하기 위하여 컴퓨터 등 정보통신설비를 이용하여 재화 등을 거래할 수 있도록 설정한 가상의 영업장을 말하며, 아울러 사이버몰을 운영하는 사업자의 의미로도 사용합니다.</li>
                                    <li>“회원”이라 함은 회사가 요구하는 항목들을 사실대로 기재하고 이 약관에 동의한 다음 회원가입신청을 하고 회사가 신청을 승낙하여 신청절차상에서 가입완료가 완료된 자를 말합니다.</li>
                                    <li>“판매자”란 상품 또는 서비스의 원활한 판매를 위하여 회사로부터 회사와 이용계약을 체결하여 쇼핑에서 상품을 판매하는 자로서 오픈마켓 서비스의 경우에는 회원이 구매한 상품 및 거래에 대한 직접적인 책임을 지는 자를 말합니다.</li>
                                    <li>“스타”란 회원 스스로 또는 회사와 서비스 및 스타 제공 계약을 체결한 회원사가 구매하여 회원에게 지급하여, 회원이 스타 사용처에서 사용할 수 있는 사이버머니를 말합니다.</li>
                                    <li>“할인쿠폰”이란 상품 또는 서비스를 구매할 때 쿠폰에 표시된 금액 또는 비율만큼 구매가격을 할인 받을 수 있는 쿠폰을 말합니다.</li>
                                    <li>“선물하기”란 회원이 앱 내에서 상품을 구매한 후 수신자를 지정하여 상품을 선물할 수 있도록 회사에서 제공하는 서비스를 말합니다.</li>
                                    <li>“정기결제”란 회원이 상품 대금을 지급하기 위해 미리 입력/등록한 결제수단 또는 결제정보를 통하여 일정한 시기에 이용료를 자동으로 결제하는 서비스를 말합니다.</li>
                                </ol>
                            </li>
                        </ol>
                    </div>
                </div>
                <div class="terms-item">
                    <h2>제 3 조 (약관의 게시와 개정)</h2>
                    <div class="terms-list">
                        <ol>
                            <li>회사는 이 약관을 회원이 그 전부를 인쇄할 수 있고 확인할 수 있도록 기술적 조치를 취합니다.</li>
                            <li>회사는 회원이 약관에 동의하기에 앞서 약관에 정해져 있는 내용 중 청약철회 등과 같은 중요한 내용을 회원이 쉽게 이해할 수 있도록 별도의 연결화면 또는 팝업화면 등을 제공합니다.</li>
                            <li>회사는 ‘콘텐츠산업진흥법’, ‘전자상거래등에서의소비자보호에관한법률’, ‘약관의규제에관한법률’, ‘전자문서 및 전자거래기본법’, ‘전자금융거래법’, ‘전자서명법’, ‘정보통신망 이용촉진 및 정보보호 등에 관한 법률’ 등 관련 법령을 위배하지 않는 범위에서 이 약관을 개정할 수 있습니다.</li>
                            <li>회사가 약관을 개정할 경우에는 적용일자 및 개정사유를 명시하여 서비스 초기 화면에 그 개정약관의 적용일자 7일 전부터 적용일자 전일까지 공지합니다. 다만, 회원에게 불리한 약관의 개정의 경우에는 30일 전부터 적용일자 전일까지 공지하며, 최소 30일 전부터 오케어에 등록된 이메일 주소로 이메일 발송 또는 등록한 휴대번호로 문자메시지 발송하는 방법 등으로 개별적으로 알려드리겠습니다.
        공지 외에 일정기간 서비스 내 전자우편, 전자쪽지, 로그인시 동의창 등의 전자적 수단을 통해 따로 명확히 통지하도록 합니다. 연락처 미기재, 변경 등으로 인하여 여러분에 대한 개별 통지가 어려운 경우와 여러분이 등록한 연락처로 고지를 하였음에도 2회 이상 반송된 경우 오케어 서비스 알림에 7일 이상 게시를 함으로써 개별 통지한 것으로 봅니다.
        </li>
                            <li>회사가 전항에 따라 개정약관을 공지 또는 통지하면서 회원에게 공지 또는 통지일로부터 개정약관 시행일로부터 7일 후까지 거부의사를 표시하지 아니하면 승인한 것으로 본다는 뜻을 명확하게 고지하였음에도 회원이 명시적으로 거부 의사표시를 하지 아니한 경우 회원이 개정약관에 동의한 것으로 봅니다.</li>
                            <li>회원이 개정약관의 적용에 동의하지 않는 경우 회사는 개정 약관의 내용을 적용할 수 없으며, 이 경우 회원은 이용계약을 해지할 수 있습니다. 다만, 기존 약관을 적용할 수 없는 특별한 사정이 있는 경우에는 회사는 이용계약을 해지할 수 있습니다.</li>
                            <li>회원은 전항에 따른 이용계약의 해지로 손해가 발생한 경우 회사에 이에 대한 배상을 청구할 수 있습니다.</li>
                        </ol>
                    </div>
                </div>
                <div class="terms-item">
                    <h2>제4조 (약관의 해석)</h2>
                    <div class="terms-list">
                        <p class="head">이 약관에서 정하지 아니한 사항과 이 약관의 해석에 관하여는 전자상거래등에서의소비자보호에관한법률’, ‘약관의규제에관한법률’, ‘전자문서 및 전자거래기본법’, ‘전자금융거래법’, ‘전자서명법’, ‘정보통신망 이용촉진 및 정보보호 등에 관한 법률’ 기타 관계법령, ‘KB오케어 서비스 이용약관’ 또는 상관례에 따릅니다.</p>
                    </div>
                </div>
                <div class="terms-item">
                    <h2>제5조 (회원에 대한 통지)</h2>
                    <div class="terms-list">
                        <ol>
                            <li>회사가 회원에 대한 통지를 하는 경우 이 약관에 별도 규정이 없는 한 KB오케어에 등록된 이메일 주소로 이메일 발송 또는 등록한 휴대번호로 문자메시지를 발송할 수 있습니다.</li>
                            <li>회사는 회원 전체에 대한 통지의 경우 7일 이상 회사의 게시판에 게시함으로써 제1항의 통지에 갈음할 수 있습니다. 다만, 회원 본인의 거래와 관련하여 중대한 영향을 미치는 사항에 대하여는 제1항의 통지를 합니다.</li>
                        </ol>
                    </div>
                </div>
                <div class="terms-item">
                    <h2>제6조 (서비스의 내용 등의 게시)</h2>
                    <div class="terms-list">
                        <ol>
                            <li>회사는 다음 사항을 해당 KB오케어 및 파트너 유료서비스의 이용 초기화면이나 FAQ 등에 회원이 알기 쉽게 표시합니다.
                                <ol>
                                    <li>재화 및 서비스 등의 명칭 또는 제호</li>
                                    <li>재화 및 서비스 제공자의 성명(법인인 경우에는 법인의 명칭), 주소, 전화번호</li>
                                    <li>재화 및 서비스 등의 내용, 이용방법, 이용료, 기타 이용조건</li>
                                </ol>
                            </li>
                            <li>회사는 재화 및 서비스 등을 제공함에 있어 재화 및 서비스 등의 교환·반품·보증과 그 대금 환불의 조건 및 절차에 관한 사항을 제공합니다.</li>
                            <li>오케어쇼핑이 제공하는 재화 및 서비스의 이용권 또는 상품권 등은 오케어쇼핑 외 제3자를 통해 판매될 수 있으며 해당 판매 상품의 이용 방식, 청약철회 및 환불 등은 각 제휴 및 파트너사가 제공하는 유료서비스 이용약관 및 정책에 따릅니다.</li>
                            <li>오케어쇼핑과 하이퍼링크 방식으로 연결된 피연결 웹 사이트(이하 “피연결몰”)이 독자적으로 제공하는 재화 및 서비스 등에 의하여 이용자와 행하는 거래에 대해서 보증책임을 지지 않는다는 뜻을 오케어쇼핑의 초기화면 또는 연결되는 시점의 팝업화면으로 명시한 경우에는 그 거래에 대한 보증 책임을 지지 않습니다.</li>
                        </ol>
                    </div>
                </div>
                <div class="terms-item">
                    <h2>제7조 (서비스 이용계약의 성립 등)</h2>
                    <div class="terms-list">
                        <ol>
                            <li>회원은 회사가 제공하는 다음 또는 이와 유사한 절차에 의하여 이용신청을 합니다. 회사는 계약 체결 전에 각 호의 사항에 관하여 회원이 정확하게 이해하고 실수 또는 착오 없이 거래할 수 있도록 정보를 제공합니다.
                                <ol>
                                    <li>재화 및 서비스 등의 확인 및 선택</li>
                                    <li>결제방법의 선택 및 결제정보의 입력</li>
                                    <li>재화 및 서비스의 이용신청에 관한 확인 또는 회사의 확인에 대한 동의</li>
                                </ol>
                            </li>
                            <li>회사는 회원의 이용신청이 다음 각 호에 해당하는 경우에는 승낙하지 않거나 승낙을 유보할 수 있습니다.
                                <ol>
                                    <li>실명이 아니거나 타인의 명의를 이용한 경우</li>
                                    <li>허위의 정보를 기재하거나, 회사가 제시하는 내용을 기재하지 않은 경우</li>
                                    <li>미성년자가 ‘청소년보호법’ 등 관련 법령에 의해서 이용이 금지되는 유료서비스를 이용하고자 하는 경우</li>
                                    <li>서비스 관련 설비의 여유가 없거나, 기술상 또는 업무상 문제가 있는 경우</li>
                                </ol>
                            </li>
                            <li>이용계약의 성립시기는 ‘가입완료’ 또는 ‘결제완료’, ‘구매완료’를 신청절차 상에서 표시한 시점으로 합니다.</li>
                            <li>회원이 재화 및 서비스를 이용하기 위해서는 이 약관에 동의 후 각 서비스에 따른 이용조건에 따라 이용요금을 지급하여야 합니다.</li>
                        </ol>
                    </div>
                </div>
                <div class="terms-item">
                    <h2>제8조 (서비스의 중단 및 변경)</h2>
                    <div class="terms-list">
                        <ol>
                            <li>사업 종목의 전환, 사업의 포기, 업체 간의 통합 등의 이유로 오케어쇼핑 유료서비스를 제공할 수 없게 되는 경우에는 회사는 이 약관에서 정한 방법으로 회원에게 통지하고 유료 결제하였으나 완료되지 못한 재화 및 서비스 또는 ‘콘텐츠이용자보호지침’ 및 관련 법령 규정에서 정한 바에 따라 회원에게 보상합니다.</li>
                            <li>회사는 상당한 이유가 있는 경우에 운영상, 기술상의 필요에 따라 제공하고 있는 전부 또는 일부의 오케어쇼핑 및 유료서비스를 변경할 수 있고, 변경 전 오케어쇼핑 유료서비스의 안내 및 고지에 관련 사항을 게시합니다.</li>
                        </ol>
                    </div>
                </div>
                <div class="terms-item">
                    <h2>제9조 (회원의 청약철회 및 계약해지)</h2>
                    <div class="terms-list">
                        <ol>
                            <li>회사와 오케어쇼핑 유료서비스 이용계약을 체결한 회원은 관련 법령에서 정한 바에 따라 일정 기간 내에 청약을 철회할 수 있습니다. 단, 오케어쇼핑 유료서비스에는 ‘콘텐츠산업진흥법’, ‘전자상거래등에서의소비자보호에관한법률’ 등에서 규정하는 청약철회가 불가능한 서비스가 포함되어 있습니다. 이 경우 회사는 청약철회권 제한을 위해 관련 법령상 필요한 조치를 취합니다.</li>
                            <li>회원은 다음 각 호의 사유가 있을 때 오케어쇼핑 유료서비스 이용계약을 해지 또는 해제할 수 있습니다.
                                <ol>
                                    <li>오케어쇼핑 유료서비스의 하자를 회사가 보완, 수정할 수 없는 경우 오케어쇼핑 유료서비스를 공급받은 날로부터 1개월 이내</li>
                                    <li>오케어쇼핑 유료서비스 회원이 이 약관의 개정 또는 제7조 제2항 단서에 따른 서비스 변경에 동의하지 않아 회원탈퇴 또는 오케어쇼핑 유료서비스 이용계약을 해지하는 경우</li>
                                    <li>회원이 전항에 따라 오케어쇼핑 유료서비스 이용계약을 해지 또는 해제하는 경우 회사는 회원으로부터 지급받은 대금을 당초 회사에서 정한 조건 또는 ‘콘텐츠이용자보호지침’ 및 관련 법령 규정, 이 약관에서 정한 바에 따라 회원에게 환불합니다.</li>
                                </ol>
                            </li>
                        </ol>
                    </div>
                </div>
                <div class="terms-item">
                    <h2>제10조 (회사의 계약해제, 해지 및 이용제한)</h2>
                    <div class="terms-list">
                        <ol>
                            <li>회사는 회원이 KB오케어 이용약관에서 정한 금지행위를 하였을 경우 해당 조항에 따라 사전통지 없이 계약을 해제, 해지하거나 또는 기간을 정하여 서비스이용을 제한할 수 있습니다.</li>
                            <li>제1항의 사유로 환불이 필요할 경우 회사는 회원이 유료서비스 이용으로부터 얻은 이익 및 환불수수료(10% 또는 1,000원 중 큰 금액)에 해당하는 금액을 공제하고 다음 각호에 따라 환불합니다.
                                <ol>
                                    <li>회사는 회원에게 계약해제, 해지의 의사표시에 대하여 회신한 날로부터 3영업일 이내에 대금의 결제와 동일한 방법으로 이를 환불하여야 하고 동일한 방법으로 환불이 불가능할 때에는 이를 사전에 고지하여야 합니다. 다만, 수납확인이 필요한 결제수단의 경우에는 수납확인일로부터 3영업일 이내에 이를 환불하도록 합니다.</li>
                                    <li>회사는 위 대금을 환불함에 있어서 회원이 신용카드 또는 전자화폐 등의 결제수단으로 재화 등의 대금을 지급한 때에는 지체 없이 당해 결제수단을 제공한 사업자로 하여금 재화 등의 대금의 청구를 정지 또는 취소하도록 요청합니다. 다만, 제2항 각 호외의 본문 및 제2항 제1호 단서의 경우에는 그러하지 아니할 수 있습니다.</li>
                                </ol>
                            </li>
                            <li>제1항의 해제, 해지는 회사가 정한 통지방법에 따라 회원에게 그 의사를 표시한 때에 효력이 발생합니다.</li>
                            <li>회사의 해제, 해지 및 이용제한에 대하여 회원은 회사가 정한 절차에 따라 이의신청을 할 수 있습니다. 이 때 이의가 정당하다고 회사가 인정하는 경우, 회사는 즉시 서비스의 이용을 재개합니다.</li>
                        </ol>
                    </div>
                </div>
                <div class="terms-item">
                    <h2>제11조 (스타 지급 및 사용)</h2>
                    <div class="terms-list">
                        <ol>
                            <li>스타는 오케어쇼핑에서 제공하는 각종 유료서비스를 이용할 수 있는 이용 요금 결제 수단인 사이버머니를 말합니다.</li>
                            <li>스타는 회원 스스로 또는 회사와 서비스 및 스타 제공 계약을 체결한 회원사가 구매할 수 있습니다.</li>
                            <li>회원사는 회원사의 임직원, 보유고객 및 제3자에게 구매한 스타를 지급할 수 있습니다.</li>
                            <li>스타 사용은 오케어쇼핑 운영정책 및 회사와 회원사의 계약구조에 따라 사용처 및 사용금액이 제한될 수 있으며, 이와는 별도로 유료서비스를 제공하는 파트너사의 정책에 따라 사용금액 및 사용비율에 제한이 있을 수 있습니다.</li>
                            <li>스타 1원은 현금 1원과 같은 비율로 사용되며, 오케어쇼핑에서 각 유료서비스를 위한 결제수단으로 사용이 가능합니다.</li>
                            <li>회사는 회원의 스타에 대한 금융이자 지급 의무는 없습니다.</li>
                            <li>스타는 회원이 스타를 마지막 적립,충전,사용한 날로부터 5년간 유효하며, 유효기간이 경과된 스타는 충전한 날을 기점으로 순차적으로 자동 소멸됩니다. 단, 회원사와 별도의 유효기간 계약이 있는 경우에는 지급 페이지 내에 별도로 제공합니다.</li>
                        </ol>
                    </div>
                </div>
                <div class="terms-item">
                    <h2>제12조 (할인쿠폰)</h2>
                    <div class="terms-list">
                        <ol>
                            <li>할인쿠폰은 오케어쇼핑에서 제공하는 각종 재화 및 서비스를 일정액 또는 일정비율을 할인 받을 수 있는 수단을 말합니다.</li>
                            <li>할인쿠폰은 회원 스스로 또는 회사와 서비스 및 쿠폰 제공 계약을 체결한 회원사가 구매할 수 있습니다.</li>
                            <li>회사는 파트너, 재화 및 서비스의 품목, 거래금액 등에 따라 할인쿠폰의 사용을 제한할 수 있습니다.</li>
                            <li>할인쿠폰의 부여 및 사용에 관한 상세한 사항은 회사가 정한 정책에 따르며, 회사는 오케어쇼핑 서비스 페이지를 통하여 이를 회원에게 안내합니다.</li>
                            <li>회원은 할인쿠폰을 명시된 사용 기간 내만 사용할 수 있습니다.</li>
                            <li>회원은 할인쿠폰을 본인의 거래에 대해서만 사용할 수 있으며, 어떠한 경우라도 할인쿠폰을 타인에게 매매 또는 양도할 수 없습니다.</li>
                            <li>회원이 부정 또는 부당하게 할인쿠폰을 취득한 경우 회원은 할인쿠폰을 사용할 수 없으며, 회사는 이를 회수할 수 있습니다.</li>
                        </ol>
                    </div>
                </div>
                <div class="terms-item">
                    <h2>제13조 (모바일 상품권)</h2>
                    <div class="terms-list">
                        <ol>
                            <li>"회사"가 취급하는 재화 및 서비스 중 "회원"이 구매 후 "회사"의 제휴업체 또는 제휴업체가 지정하는 장소에서 본인 확인절차를 거쳐 서비스를 받을 수 있는 모바일 상품권 서비스의 경우 구매 "회원"은 서비스 상품의 개별판매 조건에 명시된 유효 기간 내에 한해서만 모바일 상품권 서비스를 사용할 수 있습니다. "회원"이 유효기간 내에 모바일 상품권 서비스를 사용하지 못한 경우에는 환불을 받으실 수 없습니다.</li>
                            <li>"회원"은 "사이트"에 명시된 내용 및 개별 주의사항(사용정보 등)을 확인하여야 할 책임이 있으며, 명시된 이용조건에 따라서만 모바일 상품권 서비스를 이용할 수 있습니다. "회원"은 모바일 상품권 서비스를 타인에게 양도하거나 담보로 제공할 수 없으며, "회원"이 이를 위반하여 "회사"의 제휴업체 또는 제휴업체가 지정하는 장소에서 서비스를 제공받지 못하는 등의 손해가 발생하는 경우에 "회사"에게 이의를 제기하지 못합니다.</li>
                            <li>"회원"의 모바일 상품권 서비스 구매처리가 완료되었음을 안내하는 등 특정 서비스 이용권의 매매를 증명하기 위하여 발송된 이메일, 문자 메시지 등을 소지하는 것만으로는 본 조 제1항의 본인 확인절차를 갈음할 수 없습니다.</li>
                        </ol>
                    </div>
                </div>
                <div class="terms-item">
                    <h2>제14조 (책임 제한)</h2>
                    <div class="terms-list">
                        <ol>
                            <li>회사는 관계법령의 변경, 천재지변 또는 이에 준하는 불가항력으로 인하여 서비스를 제공할 수 없는 경우에는 서비스 제공에 관한 책임이 면제됩니다.</li>
                            <li>회사는 회원의 귀책사유로 인한 서비스 이용의 장애에 대하여는 회사의 귀책사유가 없는 한 책임을 지지 않습니다.</li>
                            <li>회사는 회원 상호간 또는 회원과 제3자간에 재화 및 서비스를 매개로 하여 발생한 분쟁 등에 대하여 회사의 귀책사유가 없는 한 책임을 지지 않습니다.</li>
                        </ol>
                    </div>
                </div>
                <div class="terms-item">
                    <h2>제15조 (분쟁해결)</h2>
                    <div class="terms-list">
                        <ol>
                            <li>회사는 회원이 제기하는 정당한 의견이나 불만을 반영하고 그 피해를 보상처리하기 위하여 KB오케어 앱 고객센터 메뉴 내 Q&A를 운영합니다.</li>
                            <li>회사는 회원으로부터 제출되는 불만사항 및 의견을 우선적으로 처리합니다. 다만, 신속한 처리가 곤란한 경우에는 이용자에게 그 사유와 처리일정을 통보해 드립니다.</li>
                        </ol>
                    </div>
                </div>
                <div class="terms-item">
                    <h2>제16조 (재판관할)</h2>
                    <div class="terms-list">
                        <p class="head">본 약관 또는 오케어쇼핑 서비스와 관련된 회원과 회사와의 관계는 대한민국 법령이 적용됩니다. 그리고 본 약관 또는 오케어쇼핑 유서비스와 관련하여 여러분과 오케어쇼핑 사이에 분쟁이 발생할 경우, 그 분쟁의 처리는 대한민국 민사소송법에서 정한 절차를 따릅니다.</p>
                    </div>
                </div>
            </div>
        </template>
        <template #modalButton>
          <v-btn
            variant="text"
            height="56"
            class="btn-summit"
            @click="documentModal = false"
            >동의</v-btn
          >
        </template>
      </DocumentModal>
      <!-- //TermsModal -->
    </div>
  </template>
  
  <script>
    import { ref } from 'vue'
    import DocumentModal from '@/components/DocumentModal.vue'
    export default {
      components: { DocumentModal },
      setup() {
        const documentModal = ref(true)
        return {
          documentModal
        }
      }
    }
  </script>
